[
  {
    "name": "Creamy chicken pasta",
    "ingredientsAndQuantities": "$180g/6oz pasta $150g/5½oz leftover roast chicken, shred into bite-sized pieces$1 tbsp plain flour$large knob of butter$8 large chestnut mushrooms, peeled and sliced $½ bunch spring onions, roughly chopped$generous splash dry white wine (optional)$1½ tbsp single cream $salt and freshly ground black pepper",
    "ingredients": [
      { "name": "pasta" },
      { "name": "roast chicken" },
      { "name": "plain flour" },
      { "name": "butter" },
      { "name": "chestnut mushrooms" },
      { "name": "spring onions" },
      { "name": "white wine" },
      { "name": "single cream" },
      { "name": "black pepper" }
    ],
    "description": "Inspired by the comforting flavours of traditional chicken pie fillings, this easy creamy chicken pasta is perfect for using up the leftovers from a roast chicken.",
    "method": "$Cook the pasta in a pan of boiling salted water over a high heat until just tender. $Meanwhile, make the sauce. Toss together the chicken, flour and a generous amount of salt and pepper until the chicken is well coated.$Heat the butter in a very large frying pan over a medium–high heat. When it is frothing, add the mushrooms and spring onions and fry for 5 minutes, or until tender and the onions are slightly golden. $Reduce the heat to medium and add the chicken. Stir until everything is combined and then add the wine, if using (use stock if not, as the sauce will lack flavour if you just use water). Allow to bubble and turn the heat down to low. When the chicken is cooked through and hot, stir in the single cream and season to taste.$Drain the pasta, reserving 6–8 tablespoons of the pasta water.$Stir the pasta into the sauce, adding the pasta water a tablespoon at a time until the sauce has reached your preferred consistency. Serve immediately. ",
    "prepTime": "less than 30 mins",
    "cookTime": "10 to 30 mins",
    "vegetarian": false,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 2",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/1_creamy_chicken_pasta_24218_16x9.jpg"
  },
  {
    "name": "2-hour Christmas dinner",
    "ingredientsAndQuantities": "$2.5kg/5lb 8oz turkey crown (fully thawed if frozen)$6 rashers smoked streaky bacon$sunflower oil, for greasing$large knob of butter $2 medium leeks, trimmed$5 thick slices white bread $1 x 120g pack mixed nuts and dried fruit (I use one containing brazil nuts, pecans, almonds, sultanas and dried cranberries)$1 small bunch fresh thyme, finely chopped $1 large unwaxed lemon, finely grated zest only$450g/1lb pork sausagemeat$salt and freshly ground black pepper$1.2kg/2lb 12oz potatoes, preferably Maris Piper or King Edward, peeled and cut into large chunks$4 tbsp sunflower oil or melted goose fat$8–12 chipolata sausages, wrapped in bacon$a few sprigs fresh rosemary (optional)$2 tbsp runny honey$750–900ml/1⅓–1⅔ pint readymade chicken gravy$2 rashers smoked streaky or back bacon, roughly chopped$4 tbsp ruby port or red wine$2 tbsp cranberry sauce$½ tsp dried sage (optional)$2 x 40g packets bread sauce mix$500ml/18fl oz milk$4 tbsp double cream$25g/1oz butter$freshly grated nutmeg, to serve (optional)$600g/1lb 5oz ready-prepared carrot sticks$2 tbsp orange juice (fresh or from a carton)$knob of butter $2 tbsp chopped frozen parsley or 3 tbsp freshly chopped parsley$2 good pinches caster sugar$25g/1oz butter$4 rashers rindless smoked streaky bacon, cut into 2cm/¾in pieces$300g/10½oz ready-trimmed baby Brussels sprouts, halved$200g/7oz cooked and peeled chestnuts, vacuum-packed or frozen and thawed, halved$sea salt and freshly ground black pepper",
    "ingredients": [
      { "name": "turkey crown" },
      { "name": "bacon" },
      { "name": "butter" },
      { "name": "leeks" },
      { "name": "white bread" },
      { "name": "dried fruit" },
      { "name": "thyme" },
      { "name": "lemon" },
      { "name": "sausagemeat" },
      { "name": "black pepper" },
      { "name": "sunflower oil" },
      { "name": "sausages" },
      { "name": "rosemary" },
      { "name": "honey" },
      { "name": "gravy" },
      { "name": "bacon" },
      { "name": "red wine" },
      { "name": "cranberry sauce" },
      { "name": "sage" },
      { "name": "bread sauce" },
      { "name": "milk" },
      { "name": "double cream" },
      { "name": "butter" },
      { "name": "nutmeg" },
      { "name": "carrot" },
      { "name": "orange juice" },
      { "name": "butter" },
      { "name": "parsley" },
      { "name": "parsley" },
      { "name": "caster sugar" },
      { "name": "butter" },
      { "name": "bacon" },
      { "name": "Brussels sprouts" },
      { "name": "chestnuts" },
      { "name": "black pepper" }
    ],
    "description": "This roast turkey recipe is served with shortcut sides to make your life so much easier. You will need to buy some ready-made cheats, but the payoff is that the whole delicious Christmas dinner is done in less than 2 hours!",
    "method": "$Preheat the oven to 220C/200C Fan/Gas 7.$For the turkey and stuffing, put the turkey crown on a lightly oiled baking tray and pat dry with kitchen paper. Season with lots of coarsely ground black pepper. Cover the breast with bacon rashers, then cover the turkey with lightly oiled foil and roast for 1 hour.$While the turkey is roasting, prepare the stuffing. Melt the butter in a large non-stick frying pan. Thinly slice the leeks. Add to the pan and cook over a low heat for 3–4 minutes, or until softened, stirring regularly.  $Tip the leeks into a large, shallow ovenproof dish – a lasagne dish would work well. Tear the bread into small cubes and don’t worry about the crusts, just add those too. Tip the nuts and fruit onto a board and cut any large nuts in half or quarters, then add to the bread and leeks. Add roughly three-quarters of the thyme to the stuffing mixture and sprinkle the lemon zest on top. Add the sausagemeat and season with a little salt and lots of black pepper. Mix all the ingredients thoroughly with your hands, leaving it fairly chunky. Spread loosely over the dish and set aside.$When the turkey has been cooking for 1 hour, take out of the oven and reduce the temperature to 200C/180C Fan/Gas 7. Take the turkey crown carefully off the tray and place directly on top of the stuffing. Place in the oven and roast the turkey and stuffing for 30 minutes, then remove the foil and cook for a further 15 minutes, or until the turkey is fully cooked and the juices run clear when the thickest part is pierced with a skewer. $Meanwhile, for the roast potatoes, put the potatoes in a large saucepan or flameproof casserole and cover with cold water. Place over a high heat and bring to the boil. Reduce the heat slightly and simmer for 3 minutes. Drain the potatoes in a large colander and return to the saucepan. Shake vigorously to knock the potatoes about and scuff up the surface – this will make them much crisper when they roast.$Pour the oil over and toss together well. Scatter in a single layer onto a baking tray and roast for an hour, or until the potatoes are golden, crisp and tender in the centre.$Meanwhile, for the pigs in blankets, tuck a small sprig of rosemary under the bacon on each sausage. Place on a lightly oiled baking tray with the potatoes and drizzle with the honey. Roast for 15–20 minutes, or until lightly browned and cooked through.$Remove the turkey from the oven, cover loosely with kitchen foil and a couple of dry tea towels and leave to rest for 15 minutes. $For the bread sauce (if making), put the bread sauce mix in a non-stick saucepan and stir in roughly a quarter of the milk. Mix until well combined, then add the remaining milk and bring to a gentle simmer. Cook for 3–4 minutes, stirring regularly, until thick and smooth, then add the cream and butter and cook for 1–2 minutes more. Pour into a warmed dish, sprinkle with a little nutmeg, and keep warm until ready to serve.$For the carrots, put the carrots in a microwave-proof serving dish and pour over the orange juice, dot with butter, sprinkle with parsley, add sugar and season with a little salt and lots of black pepper. Cover with cling film or a plate and cook on HIGH for 8 minutes, or until just tender, stirring halfway through cooking.$For the sprouts, put the butter, bacon, sprouts and chestnuts in a large non-stick saucepan or sauté pan and season well with black pepper. Add 200ml/7fl oz cold water and bring to the boil. Cook for about 5 minutes, stirring regularly until the sprouts are tender and the liquid has evaporated.$Meanwhile, for the gravy, put the gravy, bacon, port, cranberry sauce and dried sage, if using, in a medium saucepan and bring to a simmer. Reduce the heat and cook gently for 5 minutes, stirring occasionally. Season with black pepper and a little salt, if needed. Keep warm until ready to serve.$To serve, warm your serving plates. Strain the gravy into warmed gravy boats and put on the table along with the roast potatoes, pigs in blankets, carrots and bread sauce (if making). Sprinkle the turkey with the remaining thyme and serve in the roasting dish along with the stuffing. Carve at the table.",
    "prepTime": "30 mins to 1 hour",
    "cookTime": "1 to 2 hours",
    "vegetarian": false,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 6-8",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/2_hour_christmas_dinner_79341_16x9.jpg"
  },
  {
    "name": "Hoisin noodles",
    "ingredientsAndQuantities": "$2 nests medium egg noodles$1 tbsp hoisin sauce$1½ tbsp soy sauce, plus extra for seasoning if needed$½ tsp toasted sesame oil $50g/1¾oz baby spinach$2 free-range eggs$2 large spring onions, thinly sliced$salt$toasted sesame seeds (optional), to garnish",
    "ingredients": [
      { "name": "noodles" },
      { "name": "hoisin sauce" },
      { "name": "seasoning" },
      { "name": "sesame oil" },
      { "name": "spinach" },
      { "name": "eggs" },
      { "name": "spring onions" },
      { "name": "sesame seeds" }
    ],
    "description": "Hoisin is the secret to creating an easy, no-cook Chinese sauce to serve with these cheap and cheerful noodles. Cooking the noodles and spinach in the same pan helps cut down on washing up, too. Make this dish for less than £1 per portion.\nEach serving provides 385 kcal, 18g protein, 56g carbohydrate (of which 8g sugars), 8.5g fat (of which 2g saturates), 5.5g fibre and 3.5g salt.",
    "method": "$Cook the egg noodles in a pan of boiling water with a pinch of salt, over a medium–high heat according to packet instructions, until tender.$Meanwhile, whisk together the hoisin, soy sauce and sesame oil to make the sauce. You might want to add an extra half tablespoon of soy sauce, depending on how much salt there is in the hoisin sauce.$Remove the noodles from the heat and add the spinach to the pan.$While the spinach is wilting, dry fry the eggs in a non-stick frying pan over a high heat, taking care to ensure the eggs do not burn. $Drain the noodles and spinach well before returning them to the pan. Stir in the sauce and the spring onions. The spinach should contain enough residual water to help the sauce cover the noodles, but you can always add more of the reserved cooking water for a looser sauce. However, be careful not to make it too watery. $Divide the noodles between two bowls and top each with a fried egg. Sprinkle over the sesame seeds before serving, if using.",
    "prepTime": "less than 30 mins",
    "cookTime": "10 to 30 mins",
    "vegetarian": true,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 2",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/1_hoisin_spinach_and_egg_86057_16x9.jpg"
  },
  {
    "name": "Mixed vegetable and almond biryani",
    "ingredientsAndQuantities": "$1 tbsp vegetable oil$1 large onion, thinly sliced$1 tsp sea salt$2 large garlic cloves, finely chopped$1 tsp ground cumin$1 tbsp ground coriander$1 tbsp garam masala$3 green cardamom pods, lightly crushed$1 vegetable stock cube$300g/10½oz mixed frozen chopped vegetables$300g/10½oz basmati rice$50g/1¾oz flaked almonds$large handful fresh coriander, chopped$½ lemon, juice only",
    "ingredients": [
      { "name": "vegetable oil" },
      { "name": "onion" },
      { "name": "sea salt" },
      { "name": "garlic" },
      { "name": "cumin" },
      { "name": "coriander" },
      { "name": "garam masala" },
      { "name": "cardamom" },
      { "name": "vegetable stock" },
      { "name": "vegetables" },
      { "name": "basmati rice" },
      { "name": "flaked almonds" },
      { "name": "fresh coriander" },
      { "name": "lemon" }
    ],
    "description": "This gently spiced biryani costs just £1 per portion. It makes use of that packet of chopped mixed veg languishing at the bottom of your freezer. Enjoy it by itself with a dollop of yogurt and mango chutney, or as part of a feast – it's particularly delicious with aloo gosht.\nEach serving provides 429 kcal, 10.5g protein, 70g carbohydrate (of which 5.5g sugars), 11.5g fat (of which 1g saturates), 2g fibre and 2.9g salt.",
    "method": "$Heat the oil over a medium heat in a large, heavy bottomed, lidded saucepan. Fry the onions with the salt for 10 minutes, or until soft and just starting to brown. $Add the garlic and fry for 1 minute, until aromatic. Add the cumin, ground coriander, garam masala and cardamom pods. Fry again for another minute and crumble in the stock cube.$Add the vegetables and rice, and stir until everything is well coated in the onion spice mixture.$Add 600ml/1 pint of water and turn up the heat to bring the rice to the boil. Put on the lid and reduce the heat as low as it will go, then allow to steam for 15 minutes. $Remove the pan from the heat, and allow the rice to rest, lid on, for a further 10 minutes.$Meanwhile, toast the almonds over a medium heat in a small frying pan until golden.$Remove the lid from the rice, and pick out the cardamom husks that should have worked their way to the top. Fluff up the rice with a fork, and stir in the flaked almonds, chopped coriander and the lemon juice before serving.",
    "prepTime": "less than 30 mins",
    "cookTime": "30 mins to 1 hour",
    "vegetarian": true,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/1_mixed_vegetable_and_84703_16x9.jpg"
  },
  {
    "name": "3 stir-fry sauces",
    "ingredientsAndQuantities": "$2 tbsp dark soy sauce or tamari$2 tsp runny honey$2 tsp cornflour$2 tbsp tomato ketchup$2 tsp runny honey$1 tsp vinegar$3 tbsp peanut butter$2 tbsp sweet chilli dipping sauce$1 tbsp dark soy sauce or tamari",
    "ingredients": [
      { "name": "soy sauce" },
      { "name": "honey" },
      { "name": "cornflour" },
      { "name": "ketchup" },
      { "name": "honey" },
      { "name": "vinegar" },
      { "name": "peanut butter" },
      { "name": "chilli" },
      { "name": "soy sauce" }
    ],
    "description": "Mix together the sauces you already have in the cupboard and get delicious results. Here we show you how to make a cheat's teriyaki sauce, an easy sweet and sour sauce, and a quick satay sauce. You’ll never buy ready-made stir-fry sauce again.",
    "method": "$To make the cheat’s teriyaki sauce, mix together the soy sauce and honey in a small bowl. Use as a dip or in a stir-fry. $To make the easy sweet and sour sauce, mix the cornflour with 2 tablespoons of water in a small bowl. Add the ketchup, honey and vinegar and mix well. Use as a dip or in a stir-fry. $To make the quick satay sauce, put all the ingredients in a small saucepan with 100ml/3½fl oz of water and warm over a low heat for 30 seconds. Use as a dip or in a stir-fry. ",
    "prepTime": "less than 30 mins",
    "cookTime": "less than 10 mins",
    "vegetarian": true,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 1",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/3_stir-fry_sauces_52376_16x9.jpg"
  },
  {
    "name": "1970s-style chicken curry",
    "ingredientsAndQuantities": "$30g/1oz unsalted butter $1 onion, finely chopped $1 green eating apple, finely chopped $2–3 tsp curry powder$1 tbsp plain flour $350ml/12fl oz chicken stock $½ leftover roast chicken, torn into pieces $splash double cream $1 squeeze lemon juice $2 tbsp sultanas$2 tbsp toasted almonds$salt and freshly ground black pepper$freshly cooked basmati rice, to serve",
    "ingredients": [
      { "name": "butter" },
      { "name": "onion" },
      { "name": "apple" },
      { "name": "curry powder" },
      { "name": "plain flour" },
      { "name": "chicken stock" },
      { "name": "roast chicken" },
      { "name": "double cream" },
      { "name": "lemon juice" },
      { "name": "sultanas" },
      { "name": "almonds" },
      { "name": "black pepper" },
      { "name": "basmati rice" }
    ],
    "description": "Take a trip back in time with this super-easy chicken curry, flavoured with apple, sultanas and toasted almonds.",
    "method": "$Melt the butter in a large pan. Add the onion and apple and cook over a medium heat until soft. $Add the curry powder and cook for a minute or so, then stir in the flour.$Pour in the stock and stir to combine. Add the chicken. Cook for 2–3 minutes, or until the chicken is warmed through.$Stir through the cream and lemon juice, then season to taste.$Scatter over the sultanas and almonds and serve with freshly cooked basmati rice.",
    "prepTime": "less than 30 mins",
    "cookTime": "10 to 30 mins",
    "vegetarian": false,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 4",
    "image": ""
  },
  {
    "name": "15 minute pasta",
    "ingredientsAndQuantities": "$350g/12oz penne pasta $2 x 80g packs Parma ham, snipped into small pieces$250g/9oz small brown chestnut mushrooms, halved or quartered$200g/7oz full-fat crème fraîche$100g/3½oz Parmesan, grated $2 tbsp chopped fresh parsley $salt and freshly ground black pepper, to taste$green salad$crunchy bread",
    "ingredients": [
      { "name": "pasta" },
      { "name": "Parma ham" },
      { "name": "chestnut mushrooms" },
      { "name": "crème fraîche" },
      { "name": "Parmesan" },
      { "name": "parsley" },
      { "name": "pepper" },
      { "name": "salad" },
      { "name": "bread" }
    ],
    "description": "This is my standby pasta supper as it is so delicious, so quick and everyone loves it. Great for everyday or for casual supper parties too. It's base is a crème fraîche pasta sauce and it's topped with crispy Parma ham, which gives tons of flavour and great texture.",
    "method": "$Cook the pasta in a pan of boiling salted water according to the packet instructions. Drain and set aside$Heat a frying pan until hot. Add the Parma ham and fry until crisp. Transfer half the ham onto a plate and set aside. Add the mushrooms to the pan and fry for 2 minutes. Add the crème fraîche and bring to the boil. Add the pasta, Parmesan and parsley and toss over the heat. Season well with salt and pepper.$Serve with a green salad and crunchy bread.",
    "prepTime": "less than 30 mins",
    "cookTime": "10 to 30 mins",
    "vegetarian": false,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/15_minute_pasta_33407_16x9.jpg"
  },
  {
    "name": "3D biscuits ",
    "ingredientsAndQuantities": "$200g/7oz unsalted soft butter$200g/7oz caster sugar$1 tsp vanilla essence$1 free-range egg, lightly beaten$400g/14oz plain flour, plus extra for dusting$1 free-range egg white$250g/9oz icing sugar$food colouring, if using$ready-to-roll icing, in colours of your choice, to decorate the biscuits",
    "ingredients": [
      { "name": "butter" },
      { "name": "caster sugar" },
      { "name": "vanilla essence" },
      { "name": "egg" },
      { "name": "plain flour" },
      { "name": "egg white" },
      { "name": "icing sugar" },
      { "name": "food colouring" }
    ],
    "description": "Simple 3D iced biscuits inspired by Bake Off. Ours are less intricate than the contestants’ creations, but just as impressive and much easier to make! You can use whatever cutters you have available – or even try a freehand creation.  \nEquipment and preparation: for this recipe you will need a rack to lean the biscuits against while the icing sets, a piping bag fitted with a small plain nozzle and biscuit cutters of your choice (it’s best to use small sizes).\n",
    "method": "$To make the basic dough, line a baking tray with baking parchment (you may need two baking trays or, alternatively, cook the biscuits in batches).$In a bowl, use a wooden spoon or a mixer to cream together the butter, sugar and vanilla essence until just creamy.  Do not over work the batter at this stage.  Beat in the egg until well combined. $Add the flour and mix on a low speed until a dough forms. In the bowl, use your hands to lightly knead the dough into a ball. Wrap it in cling film and refrigerate for least an hour.$Roll out the dough on a lightly floured work surface to a depth of about 5mm, if possible use spacers to achieve an even thickness. Cut the desired shapes. For the duck biscuits: use a duck-shaped cutter and a round cutter for the base (the base should be approximately the same size as the duck). For the tree biscuits: cut two simple tree shapes out using either a cutter or a template and cut one tree shape in half vertically. For the ladybird biscuits: cut out two rounds, one slightly smaller than the other (approx. 5cm/2in and 3cm/1¼in). For the lamb biscuits: use a cutter or a template to cut out two lamb shapes for each finished biscuit and cut two additional leg shapes separately (for each finished lamb biscuit you should have two lamb shapes and two leg shapes). For the sitting down person biscuits: cut a gingerbread person out of the dough and then cut off the legs. Trim about 2mm from around the edges of the legs and cut two slots out of the bottom of the gingerbread body, about the depth of the legs (the legs will slot in here once baked). Also cut out two small ovals for feet.  $Transfer the shapes onto the baking sheet using a palate knife and chill again for about 30 minutes. (This is important to prevent the biscuits losing their shape when baked.)$Preheat the oven to 180C/350F/Gas 4.$Bake the biscuits for 6–10 minutes, depending on size, until lightly golden-brown at the edges. Transfer to a wire rack to cool completely.$For the icing, lightly beat the egg white in a large bowl.  Add the icing sugar and mix slowly at first to avoid an icing sugar cloud. Once combined, whisk or beat for about five minutes if using an electric beater or whisk, or for longer if using a wooden spoon. Continue whisking until the ingredients form a thick, smooth paste that is bright white in colour. If you are using colours, separate the icing into various bowls and colour accordingly.\n$To decorate the duck biscuits, thinly roll out the yellow ready-to-roll icing and cover the duck shapes. Pipe on any decoration desired for the eyes, beaks and wings. Position a wire rack over a container that will hold it at a suitable height to lean the stand up biscuit against. Use the flooding technique to ice the biscuit circles (see step 10 for more information) to represent a pond. While the icing is still wet, place the round biscuit under the edge of the wire rack. Stand the duck biscuit in position on the wet icing on the round, using the rack as support to keep it upright. Allow the icing to set completely before carefully removing the support rack.\n$To flood ice the biscuits, pipe an outline around the edge of the biscuit using either a fine nozzle or by snipping the very end off a disposable piping bag. Let the icing set for a few minutes. For flooding the icing needs to be slightly runnier, so add a few drops of water. Pipe or spoon enough of the runnier icing into the centre of the iced shape to completely fill it – don’t worry about it being neat at this point. Use a toothpick to spread the icing evenly inside the hard icing ‘wall’. If the surface of the icing isn’t flat, gently shake the biscuit back and forth until you have a smooth covering.$To decorate the tree biscuits, pipe a line of green icing all around the edge and cover the biscuits using the flooding method described in step 10. Once the icing is completely dry, use some leftover icing to pipe a zig zag along the bare edge of each half tree and attach them to the middle of the whole trees  Repeat at the back of the biscuit with the remaining tree halves. You may have to hold the half trees in place while the icing sets.$To decorate the ladybird biscuits, brush the rounds with cooled boiled water and cover the larger round with a circle of pink or red ready-to-roll icing and the smaller in white ready-to-roll icing. Attach the white round to the base using a small ball of ready-to-roll icing and tilt on an angle. Finish decorating the ladybird by piping on a face and spots in black icing.$To decorate the lamb biscuits, ice half the bodies of the lambs using the flooding technique in step 10 - keeping the legs free of icing. Once the icing is dry, spread an undecorated lamb biscuit with icing and sandwich to the back of the decorated biscuit. Dot some icing on the back of the individual lamb legs and stick over the whole lamb’s legs to give a 3D effect. When the icing is dry the biscuits should stand up without support. If desired, decorate the lamb’s legs with icing.\n \n$To decorate the sitting down person biscuits, decorate the biscuit bodies as desired. Slot the legs sideways into the precut slots so the person is sitting down with their legs stretched out in front of them.  Attach the feet to the bottom of the legs using icing and leave to dry.  ",
    "prepTime": "less than 30 mins",
    "cookTime": "1 to 2 hours",
    "vegetarian": true,
    "vegan": false,
    "glutenFree": false,
    "servings": "Makes about 25 medium-sized or 12 large biscuits",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/3d_biscuits_29555_16x9.jpg"
  },
  {
    "name": "Lemon curd ice cream",
    "ingredientsAndQuantities": "$290ml/½ pint double cream$1 jar (340g/12oz) lemon curd $½ lemon, juice and zest",
    "ingredients": [
      { "name": "double cream" },
      { "name": "lemon curd" },
      { "name": "lemon" }
    ],
    "description": "",
    "method": "$Whisk the cream until floppy,  then whisk in the lemon curd along with the lemon juice and zest. $Spread in a serving dish and freeze for at least four hours.",
    "prepTime": "over 2 hours",
    "cookTime": "no cooking required",
    "vegetarian": true,
    "vegan": false,
    "glutenFree": false,
    "servings": "Makes 290ml/½ pint",
    "image": ""
  },
  {
    "name": "3 salad dressings",
    "ingredientsAndQuantities": "$2 tbsp red or white wine vinegar$1 tsp mustard, ideally Dijon or French$½ garlic clove, crushed$1½ tsp caster sugar$8 tbsp extra virgin olive oil, or a mix of olive oil and sunflower oil$salt and freshly ground black pepper$2 tbsp white wine vinegar or cider vinegar$1 tbsp wholegrain mustard$1 tbsp runny honey$6 tbsp sunflower or vegetable oil$salt and freshly ground black pepper$6 tbsp mayonnaise (around 75g/2¾oz)$2 tbsp tomato ketchup$1 tsp lemon juice$splash Worcestershire sauce$pinch cayenne pepper",
    "ingredients": [
      { "name": "white wine vinegar" },
      { "name": "mustard" },
      { "name": "garlic" },
      { "name": "caster sugar" },
      { "name": "olive oil" },
      { "name": "olive oil" },
      { "name": "black pepper" },
      { "name": "white wine vinegar" },
      { "name": "wholegrain mustard" },
      { "name": "honey" },
      { "name": "vegetable oil" },
      { "name": "black pepper" },
      { "name": "mayonnaise" },
      { "name": "ketchup" },
      { "name": "lemon juice" },
      { "name": "Worcestershire sauce" },
      { "name": "cayenne pepper" }
    ],
    "description": "These three easy salad dressings are super-simple to make from storecupboard ingredients. Take your pick from French, honey and mustard, or marie-rose.\nFrench dressing (aka vinaigrette) will transform anything from mixed salad leaves to tomatoes, avocado or tinned beans into a tasty side dish or simple starter. Try honey and mustard dressing with warm cooked new potatoes as a delicious accompaniment to sausages, pork chops or grilled chicken. Mix marie-rose dressing (aka seafood cocktail sauce) with cooked prawns and serve with Little Gem lettuce leaves or shredded iceberg lettuce for a classic prawn cocktail starter, or a sandwich filling.",
    "method": "$To make the vinaigrette, put the vinegar, mustard, garlic, sugar, a pinch of salt and some pepper into a bowl. Whisk until well combined. Gradually whisk in the oil, 2–3 teaspoons at a time, until it is all incorporated and the dressing is thick and glossy. $To make the honey and mustard dressing, put the vinegar, mustard, honey, a pinch of salt and some pepper into a bowl. Whisk until well combined. Gradually whisk in the oil, 2–3 teaspoons at a time, until it is all incorporated and the dressing is thick and glossy. $To make the marie-rose dressing, put all the ingredients in a bowl and stir until thoroughly combined.",
    "prepTime": "less than 30 mins",
    "cookTime": "no cooking required",
    "vegetarian": false,
    "vegan": false,
    "glutenFree": false,
    "servings": "Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_832/recipes/3_salad_dressings_01630_16x9.jpg"
  }
]
